/*
* Напишите функцию truncate, которая принимает строку и максимальную длину.

* Если длина строки превышает указанное количество символов, функция должна обрезать строку до этой длины и добавлять в конец многоточие (...).
* В противном случае функция должна возвращать исходную строку.

* Пример работы функции:
* truncate("Вот, что мне действительно нравится в этом", 20) // Ожидаемый результат: "Вот, что мне действи..."
* truncate("Короткая строка", 20) // Ожидаемый результат: "Короткая строка"
*/

function truncate(str, maxLength) {
  const varibal = str.length 
  if(varibal > maxLength){
    return str.slice(0,maxLength) + '...'
  }else{
    return str
  }
}

let solution = truncate("Вот, что мне действительно нравится в этом", 20);
console.log(solution);
